web_database/frontend/models/ArticleForm.php

SELECT `id`, `title`, `content` FROM `article` ORDER BY `id` DESC
---
     public static function getList( $orderBy = ['id'=> SORT_DESC])
    {
        $model = new Article();
        //构造查询语句
        //查询字段
        $select = ['id', 'title','content'];
        $res = $model->find()
          ->select($select)
          ->orderBy($orderBy)
          ->asArray()
          ->all();