web_database/frontend/models/ChinaQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `china`