web_database/frontend/models/RumourForm.php

    public static function getList( $orderBy = ['id'=> SORT_DESC])
    {
        $model = new Rumour();
        //构造查询语句
        //查询字段
        $select = ['id', 'title','content', 'info'];
        $res = $model->find()
            ->select($select)
            ->orderBy($orderBy)
            ->asArray()
            ->all();
---
SELECT `id`, `title`, `content`, `info` FROM `rumour` ORDER BY `id` DESC