web_database/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('wp4', '1527274107@qq.com', '$2y$13$ZLRjlBPKMDMHAgVkJMrNIuOmZUS9YUkBYAC3BNLzGg/qd8STC4cn2', 'twgfj5U8MYieVIJ7kV4fqRob1z6t_Nae', 10, 1604589789, 1604589789)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ;