web_database/frontend/models/TendencyQuery.php

SELECT * FROM `tendency`
---
    public function all($db = null)
    {
        return parent::all($db);