web_database/frontend/models/WishForm.php

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=39)
SELECT * FROM `Wishes` ORDER BY `id` DESC LIMIT 5
SELECT * FROM `user` WHERE `id` IN ('39', '11')
---
    public function getList()
    {
    	$model = new Wishes();
    	$res=$model->find()
    	       ->limit(5)
    	       ->with('user')
    	       ->orderBy(['id'=>SORT_DESC])
    	       ->asArray()
    	       ->all();

INSERT INTO `Wishes` (`user_id`, `content`, `username`, `created_at`) VALUES (39, '武汉加油！！！！', 'wp', 1597046984)
---
    public function create()
    {
      try{
        $model =new Wishes();
        $model->user_id =\Yii::$app->user->identity->id;
        $model->content =$this->content;
        $model->username =\Yii::$app->user->identity->username;
        $model->created_at = time();
         if(!$model->save())