web_database/frontend/controllers/CurrentController.php

UPDATE `current` SET `currentConfirmedCount`='566', `seriousCount`='825', `suspectedCount`='3480', `confirmedCount`='92085', `deadCount`='4747', `curedCount`='86772' WHERE `id`=1
---
    public function actionUpdateCurrent()
    {
        try{
        $model=Current::findModel(1);
        $model->confirmedCount=Yii::$app->request->post("confirmedCount");
        $model->deadCount=Yii::$app->request->post("deadCount");
        $model->curedCount=Yii::$app->request->post("curedCount");
        $model->currentConfirmedCount=Yii::$app->request->post("currentConfirmedCount");
        $model->seriousCount=Yii::$app->request->post("seriousCount");
        $model->suspectedCount=Yii::$app->request->post("suspectedCount");

         if(!$model->save()){