web_database/frontend/views/tendency/tendency.php

    <?= $model->deadCount;?>
    <?= $model->curedCount;?>
    <?= $model->currentConfirmedCount;?>
    <?php if(!$model->save())
---
UPDATE `current` SET `currentConfirmedCount`='<script>document.writeln(PHPcurrentConfirmedCount);</script>', `seriousCount`='<script>document.writeln(PHPseriousCount);</script>', `suspectedCount`='<script>document.writeln(PHPsuspectedCount);</script>', `confirmedCount`='<script>document.writeln(PHPconfirmedCount);</script>', `deadCount`='<script>document.writeln(PHPdeadCount);</script>', `curedCount`='<script>document.writeln(PHPcuredCount);</script>' WHERE `id`=1